app/controllers/room_messages_controller.rb

INSERT INTO "room_messages" ("room_id", "user_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["room_id", 2], ["user_id", 1], ["message", "hai rony"], ["created_at", "2024-06-11 13:29:06.076999"], ["updated_at", "2024-06-11 13:29:06.076999"]]
---
    def create
      @room_message = RoomMessage.create user: current_user,
                                         room: @room,
                                         message: params.dig(:room_message, :message)

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
      if params[:room_id].present?
        @room = Room.find_by(id: params[:room_id])
        if @room.present?

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def load_entities
      @room = Room.find params.dig(:room_message, :room_id)