app/controllers/rooms_controller.rb

SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = ?  [["room_id", 1]]
SELECT "rooms".* FROM "rooms"
---
    def show
        @room_message = RoomMessage.new room: @room
        @room_messages = @room.room_messages.includes(:user)

INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "irony"], ["created_at", "2024-06-11 13:19:26.085805"], ["updated_at", "2024-06-11 13:19:26.085805"]]
---
    def create
      @room = Room.new permitted_parameters

      if @room.save

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def load_entities
      @rooms = Room.all
      @room = Room.find(params[:id]) if params[:id]